import importlib
import streamlit as st

def show():

    st.markdown("""
    # 四、 例题分析
        
## $H_2O$
水分子属于$C_{2v}$点群：  
对于水分子的三个原子：$O$、$H_1$、$H_2$分别存在在x、y、z三个维度的极化率分量。
三个原子的三个维度的极化率分量组合成整个原子的运动方式。对于不同的对称方式，
原子沿该轴的运动可能是相同、相反、没有运动，分别对应1、-1和0。进行列表统计，可以得到：


|$$C_v$$      | $$E$$   |$$C_2$$ |$$\sigma_{xz}$$ |$$\sigma_{yz}$$|
|--------|-------- |--------|--------|-------- | 
|$$q_1(X_O)$$ | 1 | -1 |1 |-1 |
|$$q_2(Y_O)$$ | 1 | -1 |-1 |1 |
|$$q_3(Z_O)$$ | 1 | 1 |1 |1 |
|$$q_4(X_{H1})$$ | 1 | 0 |1  |0 |
|$$q_5(Y_{H1})$$ | 1 | 0 |-1  |0 |
|$$q_6(Z_{H1})$$ | 1 | 0 |1  |0|
|$$q_7(X_{H2})$$ | 1 | 0 |1  |0 | 
|$$q_8(Y_{H2})$$ | 1 | 0 |-1  |0 |
|$$q_9(Z_{H2})$$ | 1 | 0 |1  |0 |
|$$\Gamma$$ | 9  | -1 |3 |1|



根据$C_{2v}$特征标表

|$$C_v$$      | $$E$$   |$$C_2$$ |$$\sigma_{xz}$$ |$$\sigma_{yz}$$
|:--------|:-------- |:--------|:--------|:-------- | 
|$$A_1$$ | 1 | 1 |1 |1 |
|$$A_2$$| 1 | 1 |-1 |-1 |
|$$B_1$$ | 1 | -1 |1 |-1 |
|$$B_2$$ | 1 | -1 |-1  |1 |
|$$\gamma$$|4|0|0|0|

我们可以进行约化：

$$a_{A1}=(1/4)[9\\times 1+(-1)\\times 1+3\\times 1+1\\times 1]=3$$

$$a_{A2}=(1/4)[9\\times 1+(-1)\\times 1+3\\times (-1)+1\\times (-1)]=1$$

$$a_{B1}=(1/4)[9\\times 1+(-1)\\times (-1)+3\\times 1+1\\times (-1)]=3$$

$$a_{B2}=(1/4)[9\\times 1+(-1)\\times (-1)+3\\times (-1)+1\\times 1]=2$$

得到不可约表示 

$$\Gamma=3A_1\oplus A_2\oplus 3B_1\oplus 2B_2$$

根据$C_{2v}$特征标表可以知道3个不可约平动表示为$A_1、B_1、B_2$;

3个不可约转动表示为$A_2、B_1、B_2$
|$$C_v$$      | $$E$$   |$$C_2$$ |$$\sigma_{xz}$$ |$$\sigma_{yz}$$|||
|:--------|:-------- |:--------|:--------|:-------- |:-------- |:-------- | 
|$$A_1$$ | 1 | 1 |1 |1 |$$z$$|$$x^2,y^2,z^2$$|
|$$A_2$$ | 1 | 1 |-1 |-1 |$$R_z$$|$$xy$$|
|$$B_1$$ | 1 | -1 |1 |-1 |$$x,R_y$$|$$xz$$|
|$$B_2$$ | 1 | -1 |-1  |1 |$$y,R_x$$|$$yz$$|
|$$\gamma$$|4|0|0|0| | |

剩下部分为正则振动

$3A_1\oplus A_2\oplus 3B_1\oplus 2B_2$——全部对称类型
*****
$A_1\oplus B_1\oplus B_2$——平动

$A_2\oplus B_1\oplus B_2$——转动

$2A_1\oplus B_1$——正则振动对称类型
若正则振动的对称类型与偶极矩的某个分量x, y, z属于同一个不可约表示，即为红外活性；

若正则振动的对称类型与极化率的某个分量，即x, y, z的二元乘积属于同一个不可约表示，即为Raman活性。
因此可以判断三种正则振动:

两种正则运动属于$A_1$:
    
$A_1$的基为$𝑧、𝑥^2,𝑦^2,𝑧^2$，具有红外活性和Raman活性；
    
一种正则运动属于$B1$:
    
$B_1$的基为$𝑥,𝑅_𝑦、𝑥𝑧$，具有红外活性和Raman活性；
""")
    import plotly.graph_objects as go
    import numpy as np

# 模拟数据
# t = np.linspace(0, 10, 50)
# x, y, z = np.cos(t), np.sin(t), t
# x = 0, 0, 0
# y = 2, 0, 0
# z = -2*np.sin(14.5), 2*np.cos(14.5), 0

    x = 0.5, 0, -0.5*np.sin(0.253)
    y = 0, 0, 0.5*np.cos(0.253)
    z = 0, 0, 0

    fig = go.Figure(data=[go.Scatter3d(
        x=x,  # 设置3个不同的坐标数据
        y=y, 
        z=z,
        mode='lines+markers')])  # 'lines', 'markers', 'text'  3种情况的组合

    st.plotly_chart(fig)
    
    st.markdown("""
        ## $NH_3$
 水分子属于$C_{3v}$点群：  
对于氨气分子的四个原子：$N$、$H_1$、$H_2$、$H_3$分别存在在x、y、z三个维度的极化率分量。三个原子的三个维度的极化率分量组合成整个原子的运动方式。对于不同的对称方式，原子沿该轴的运动后投影到该轴。进行列表统计，可以得到：
|$$C_v$$      | $$E$$   |$$C_3$$ |$$C'_3$$ |$$\sigma_{v}$$ |$$\sigma'_{v}$$ |$$\sigma''_{v}$$ |
|--------|-------- |--------|--------|-------- |--------|--------|
|$$q_1(X_N)$$ | 1 | -1/2 |-1/2 |0|-1/2|-1/2
|$$q_2(Y_N)$$ | 1 | -1/2 |-1/2 |-1|1/2|1/2
|$$q_3(Z_N)$$ | 1 | 1 |1 |0|0|0
|$$q_4(X_{H1})$$ | 1 | -1/2 |-1/2 |0|-1/2|-1/2 
|$$q_5(Y_{H1})$$ |  1 | -1/2 |-1/2 |-1|1/2|1/2
|$$q_6(Z_{H1})$$ | 1 | 1 |1 |0|1|1
|$$q_7(X_{H2})$$ | 1 | -1/2 |-1/2 |1|-1/2|-1/2
|$$q_8(Y_{H2})$$ |  1 | -1/2 |-1/2 |-1|1/2|1/2
|$$q_9(Z_{H2})$$ | 1 | 1 |1 |1|0|1
|$$q_10(X_{H3})$$ | 1 | -1/2 |-1/2 |1|-1/2|-1/2
|$$q_11(Y_{H3})$$ |  1 | -1/2 |-1/2 |-1|1/2|1/2
|$$q_12(Z_{H3})$$ | 1 | 1 |1 |1|1|0
|$$\Gamma$$ | 12  | 0 |0 |2|2|2|

根据$C_{3v}$特征标表

|$$C_v$$      | $$E$$   |$$2C_2$$ |$$3\sigma_{xz}$$ |
|:--------|:-------- |:--------|:--------|
|$$A_1$$ | 1 | 1 |1 |
|$$A_2$$| 1 | 1 |-1 |
|$$E$$ | 2 | -1 |0 |
|$$\gamma$$|4|1|0|

我们可以进行约化：

$$a_{A1}=(1/6)[12\times 1+0\times1\times 2+2\times1\times 3]=3$$

$$a_{A2}=(1/6)[12\times 1+0\times1\times 2+2\times(-1)\times 3]=1$$

$$a_{E}=(1/6)[12\times 2+0\times(-1)\times 2+2\times0\times 3]=4$$

得到不可约表示 $$\Gamma=3A_1\oplus 1 A_2\oplus 4E$$

根据$C_{3v}$特征标表可以知道2个不可约平动表示为$A_1、E$

2个不可约转动表示为$A_2、E$

|$$C_v$$      | $$E$$   |$$2C_2$$ |$$3\sigma_{xz}$$ |||
|:--------|:-------- |:--------|:--------|:--------|:--------|
|$$A_1$$ | 1 | 1 |1 |$$Z$$|$$x^2+y^2,z^2$$|
|$$A_2$$| 1 | 1 |-1 |$$R_z$$||
|$$E$$ | 2 | -1 |0 |$$(x,y)(R_x,R_y)$$|$$(x^2-y^2,xy)(xz,yz)$$|
|$$\gamma$$|4|1|0|

剩下部分为正则振动

$3A_1\oplus 1 A_2\oplus 4E$——全部对称类型
*****
$A_1\oplus E$——平动

$A_2\oplus E$——转动

$2A_1\oplus 2E$——正则振动对称类型

其中E为两重简并，因此有6种正则振动：2个$A_1$不可约和4个$E$不可约
因此可以判断六种正则振动:

两种正则运动属于$A_1$:
    
$A_1$的基为$Z$、$x^2+y^2,z^2$，具有红外活性和Raman活性；
    
四种正则运动属于$E$:
    
$E$的基为$(x,y)(R_x,R_y)$、$(x^2-y^2,xy)(xz,yz)$，具有红外活性和Raman活性；
    
""")
    import plotly.graph_objects as go
    import numpy as np

# 模拟数据
# t = np.linspace(0, 10, 50)
# x, y, z = np.cos(t), np.sin(t), t
# x = 0, 0, 0
# y = 2, 0, 0
# z = -2*np.sin(14.5), 2*np.cos(14.5), 0
# 0,0,0; 0.5,0,0; -np.sin(0.3)*0.5,np.cos(0.3)*0.5,0; -0.15763, -0.15763, 0.44435

    x = 0.5, 0, -np.sin(0.3)*0.5, -0.15763
    y = 0, 0, np.cos(0.3)*0.5, -0.15763
    z = 0, 0, 0, 0.44435

    fig = go.Figure(data=[go.Scatter3d(
        x=x,  # 设置3个不同的坐标数据
        y=y, 
        z=z,
        mode='markers')])  # 'lines', 'markers', 'text'  3种情况的组合

    st.plotly_chart(fig)
    if 'show_code' not in st.session_state:
        st.session_state.show_code = False
        # 在侧边栏创建一个复选框来控制代码的显示
    st.session_state.show_code = st.sidebar.checkbox('显示代码', value=st.session_state.show_code)
    if st.session_state.show_code:
        with open(__file__, 'r') as file:
            code = file.read()
        st.markdown("```python\n" + code + "\n```", unsafe_allow_html=True)
    
    
 